namespace HanGang.MaterialSystem.Enum
{
    /// <summary>
    /// 试验类型
    /// </summary>
    public enum TrialType
    {
        #region 试验大类/不确定分类类型
        其它 = 0,
        理化性能 = 10,
        工艺性能 = 20,
        力学性能 = 30,
        表面性能 = 40,
        成型仿真 = 50,
        焊接性能 = 60,
        胶接性能 = 65,
        服役性能 = 70,
        涂装性能 = 80,
        #endregion

        #region 理化性能
        静态拉伸 = 90,
        弯曲 = 100,
        压缩 = 110,
        高速拉伸 = 120,
        低周疲劳 = 130,
        高周疲劳 = 140,
        金相 = 150,
        物理性能 = 160,
        化学成分 = 170,
        禁用物质 = 175,
        #endregion

        #region 工艺性能
        抗凹性能 = 180,
        二次加工脆性 = 190,
        翻边扣合性能 = 200,
        氢致延迟开裂 = 210,
        成型极限FLD= 220,
        回弹性能 = 230,
        烘烤硬化 = 240
        #endregion
    }
}
